Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Perl is designed to give you several ways to do anything, so consider picking the most readable one.
es_es: Perl está diseñado para darle varias opciones para hacer cualquier cosa, así que elija la más legible.

source: C<suidperl> is installed as a hard link to C<perl>; both C<suidperl> and C<perl> will invoke C<sperl5.8.4> automatically the set uid binary, so this change should be completely transparent.
es_es: C<suidperl> es instalado como un enlace duro a C<perl>; tanto C<suidperl> como C<perl> invocarán al binario C<sperl5.8.4> automáticamente, por lo que este cambio debería ser completamente transparente.

source: ISBN 978-0-596-00374-6 [4th edition July 2002]
es_es: ISBN 978-0-596-00374-6 [4ª edición - Julio de 2002]

source: But there are a few situations in recent Perls where programs are likely to want to call C<srand>.
es_es: Pero hay unas pocas situaciones en programas recientes de Perl donde es probable que desee llamar a C<srand>.

source: C<defined>, C<dump>, C<eval>, C<formline>, C<local>, C<my>, C<our>, C<reset>, C<scalar>, C<state>, C<undef>, C<wantarray>
es_es: C<defined>, C<dump>, C<eval>, C<formline>, C<local>, C<my>, C<our>, C<reset>, C<scalar>, C<undef>, C<wantarray>

source: In scalar context, it comes back as a single (potentially multi-line) string.
es_es: En contexto escalar, se devuelve como una sola cadena (potencialmente multi-línea).

source: This points to a closed subscription unarchived mailing list, which includes all the core committers, who be able to help assess the impact of issues, figure out a resolution, and help co-ordinate the release of patches to mitigate or fix the problem across all platforms on which Perl is supported.
es_es: Esto apunta a una lista de correo de suscripción cerrada y no archivada, que incluye a todos los participantes principales, que podrán ayudar a evaluar el impacto de los problemas, encontrar una resolución, y ayudar a coordinar la liberación de parches para mitigar o solucionar el problema en todas las plataformas en las que Perl está soportado.

source: =head2 C<keys>, C<values> work on arrays
es_es: =head2 C<keys>, C<values> funcionan con arrays

source: Finally, using C<unlink> on directories is not supported on many operating systems.
es_es: Por último, con C<unlink> en directorios no está soportado en muchos sistemas operativos.

source: s/this/<<E . 'that'
es_es: s/este/<<E . 'ese'

source: This view may conflict with other information that you may have found on the web, but that's mostly because many sources are wrong.
es_es: Nuestro enfoque puede chocar con otros que haya encontrado en Internet, pero esto se debe a que la información proporcionada por muchas fuentes no es correcta.

source: Note that if you set up a loop of piped processes, deadlock can occur unless you are very careful.
es_es: Tenga en cuenta que si se establece un circuito de procesos entubados, puede producirse un bloqueo mortal a menos que sea muy cuidadoso.

source: # insert dashes just before last line of last file
es_es: # inserta guiones justo antes de la última línea del último archivo

source: EOF this
es_es: EOF este

source: This is in practice difficult to do, as it's unclear how to escape which characters.
es_es: Esto es en la práctica es difícil de hacer, como que no está claro cómo escapar qué caracteres.

source: (But realize that what we are discussing the rules for just the I<storage> of these numbers.
es_es: (Pero no olvide que lo que estamos describiendo son solo las normas del I<almacenamiento> de estos números.

source: See also L<perlipc/"SysV IPC"> and the documentation for C<IPC::SysV> and C<IPC::Msg>.
es_es: Vea también la documentación de L<perlipc/"SysV IPC"> y C<IPC::SysV> y C<IPC::Msg>.

source: If OFFSET is negative (or more precisely, less than C<$[>), starts that far back from the end of the string.
es_es: Si DESPLAZAMIENTO es negativo (o más precisamente, menor que C<$[>), cuenta la posición desde el final de la cadena, hacia adelante.

source: Using C<C0> to get Unicode characters while using C<U0> to get I<non>-Unicode bytes is not necessarily obvious.
es_es: Usar C<C0> para obtener los caracteres Unicode mientras se utiliza C<U0> para obtener bytes I<no> Unicode, no es necesariamente obvio.

source: require 'syscall.ph'; # may need to run h2ph
es_es: require 'syscall.ph'; # puede necesitar ejecutar h2ph

source: You can specify a precision (for numeric conversions) or a maximum width (for string conversions) by specifying a C<.> followed by a number.
es_es: Puede especificar una precisión (para las conversiones numéricas) o una anchura máxima (para las conversiones de cadena) mediante la especificación de un C<.> seguido de un número.

source: But it leads to some ambiguities if there are more than 9 capture groups, as C<\10> could mean either the tenth capture group, or the character whose ordinal in octal is 010 (a backspace in ASCII).
es_es: Pero conduce a algunas ambigüedades si hay más de 9 grupos de captura, como C<\10> podría referirse al décimo grupo de captura, o al carácter cuyo ordinal en octal es 010 (un retroceso, en ASCII).

source: Also, it's worth noting that patterns defined this way probably will not be as efficient, as the optimiser is not very clever about handling them.
es_es: Además, vale la pena señalar que los patrones definidos de esta manera probablemente no serán tan eficientes, debido a que el optimizador no es muy inteligente sobre el manejo de ellos.

source: Steffen Mueller and David Golden in particular helped getting CPAN modules polished and synchronised with their in-core equivalents.
es_es: Steffen Mueller y David Golden, en particular, ayudaron a obtener módulos CPAN pulidos y sincronizados con sus correspondientes versiones incluidas en la distribución.

source: / division
es_es: / división

source: None.
es_es: Ninguno.

source: The End
es_es: Fin =head1 Nota del traductor Esta traducción C<no> es un documento legal. La expresión de la legalidad de la Licencia Artística reside únicamente en el texto original en inglés de perlartistic.pod.

# print "Yup, no 123 in $_ ";
source: print "Yup, no 123 in $_\n";
es_es: print "Yep, no hay 123 en $_\n";

source: If too many strange characters (>30%) are found, it's a C<-B> file; otherwise it's a C<-T> file.
es_es: Si se encuentran demasiados caracteres extraños (E<gt>30%), es un archivo C<-B>; de lo contrario es un archivo C<-T>.

source: Pseudohashes Will Be Removed
es_es: Pseudo-hashes serán eliminados

source: -l File is a symbolic link.
es_es: -l Archivo es un enlace simbólico.

source: Here is another real-life example.
es_es: Otro ejemplo del mundo real:

source: For example, C<LATIN SMALL LIGATURE FI> should match the sequence C<fi>.
es_es: Por ejemplo, C<LATIN SMALL LIGATURE FI> debe coincidir con la secuencia C<fi>.

source: to
es_es: a

source: See L<"Modules and Pragmata"> for more information.
es_es: Vea L<"Módulos y prágmata"> para más información.

source: The C<Text::Balanced> module (standard as of v5.8, and from CPAN before then) is able to do this properly.
es_es: El módulo C<Text::Balanced> (estándar a partir de v5.8, y desde CPAN antes de esa fecha) es capaz de hacer esto de forma correcta.

source: These are known as "barewords".
es_es: Estos son conocidos como "I<barewords>" (palabras sueltas).

source: =head2 C<h2xs> enhancements
es_es: =head2 Mejoras en C<h2xs>

source: For some dual-life modules, it has not yet been determined if the CPAN version or the blead source is canonical.
es_es: Para algunos módulos de evolución dual aún no se ha determinado si la versión canónica es la de CPAN o la del código fuente de la rama I<blead>.

source: An alternative to using substr() as an lvalue is to specify the replacement string as the 4th argument.
es_es: Una alternativa al uso substr() como un I<ivalor> es especificar la cadena de reemplazo como el cuarto argumento.

source: =head2 Recursive sort subs
es_es: =head2 Subrutinas recursivas sort

source: The documentation has been revised in places to produce more standard manpages.
es_es: La documentación ha sido revisada en diversos lugares para producir páginas de manual más estándares.

source: =item oct EXPR X<oct> X<octal> X<hex> X<hexadecimal> X<binary> X<bin>
es_es: =item oct EXPR X<oct> X<octal> X<hex> X<hexadecimal> X<binary> X<bin> X<binario>

source: On success, it returns the number of files it successfully deleted.
es_es: En caso de éxito, devuelve el número de archivos que se han eliminado correctamente.

source: printf '<%.*s>', 3, "string"; # prints "<str>"
es_es: printf '<%.*s>', 3, "cadena"; # imprime "<cad>"

source: C<end_form()> doesn't emit empty (and non-validating) C<< <div> >>
es_es: C<end_form()> ya no emite un C<< <div> >> vacío (e inválido)

source: And Larry will sleep easier, too--Wall Street programs not withstanding.
es_es: Larry también dormirá mejor (si logra no pensar en los programas que se crean para Wall Street).

source: Rather than requiring you to put parentheses around every function call and declare every variable, you can often leave such explicit elements off and Perl will figure out what you meant.
es_es: En vez de obligarle a poner paréntesis en todas las llamadas de función y declarar cada variable, puede, a menudo, dejar algunos elementos de forma explícita, y Perl intentará adivinar lo que quiere decir.

source: This requires require a 64-bit MIPS CPU (R8000, R10000, ...)
es_es: Esto requiere una CPU MIPS de 64-bit (R8000, R10000, ...)

source: $nfound = select($rout=$rin, $wout=$win, $eout=$ein, undef);
es_es: $n_encontrados = select($rout=$rin, $wout=$win, $eout=$ein, undef);

source: quotemeta (and C<\Q> ...
es_es: quotemeta (y C<\Q> ...

source: This is a new warning, produced when number has been passed as a argument to select(), instead of a bitmask.
es_es: Esta es una nueva advertencia, producida cuando un número ha sido pasado como un argumento a select(), en vez de una máscara de bits.

source: This can be done using the C<O_TRUNC> flag.
es_es: Esto se puede hacer con el uso de la bandera C<O_TRUNC>.

source: Blank lines between chunks that do different things.
es_es: Líneas en blanco entre bloques que hacen cosas diferentes.

source: And so do these:
es_es: Así como estos:

source: C<MIME::Base64> upgraded to version 3.07
es_es: C<MIME::Base64> actualizado a la versión 3.07

source: %b an unsigned integer, in binary
es_es: %b un entero sin signo, en binario

source: The values to be compared are always passed by reference and should not be modified.
es_es: Los valores a ser comparados siempre se pasan por referencia y no deben ser modificados.

source: You can use the C<local $SIG{__DIE__}> construct for this purpose, as this example shows:
es_es: Puede usar la construcción C<local $SIG{__DIE__}> para este propósito, como muestra este ejemplo:

source: Why is it free?
es_es: ¿Por qué es gratis?

source: =item ucfirst EXPR X<ucfirst> X<uppercase>
es_es: =item ucfirst EXPR X<ucfirst> X<uppercase> X<mayúscula>

source: Here are some things that are planned for perl 5.10.0 :
es_es: Aquí hay algunas cosas que están previstas para Perl 5.10.0:

source: Two potentially non-obvious but traditional C<flock> semantics are that it waits indefinitely until the lock is granted, and that its locks are B<merely advisory>.
es_es: Dos, potencialmente no obvias, pero tradicionales semánticas de C<flock> son: que espera indefinidamente hasta que el bloqueo se concede, y que sus cerrojos son B<meramente consultivos>.

source: That same loop could be replaced with a slice operation:
es_es: Ese mismo bucle podría ser sustituido por una operación de corte:

source: perlguts Perl internal functions for those doing extensions
es_es: perlguts Funciones internas para crear extensiones

source: print sort backwards @harry;
es_es: print sort al_reves @harry;

source: -A Same for access time.
es_es: -A Lo mismo, para el tiempo de acceso.

source: Returns 1 if the next read on FILEHANDLE will return end of file I<or> if FILEHANDLE is not open.
es_es: Devuelve 1 si la siguiente lectura sobre IDENTIFICADOR_ARCHIVO devolverá un fin-de-archivo, I<o> si IDENTIFICADOR_ARCHIVO no está abierto.

source: C<Carp> and the internal diagnostic routines used by C<Devel::Peek> have been made clearer, as described in L</Incompatible Changes>
es_es: C<Carp> y las rutinas de diagnóstico internas utilizadas por C<Devel::Peek> se han hecho más claras, como se describe en L</Cambios incompatibles>

source: Specify position as byte offset in the internal representation of the packed string.
es_es: Especifica una posición como desplazamiento de byte en la representación interna de la cadena empaquetada.

source: It is not recommended for production code.
es_es: No se recomienda para código en producción.

source: Returns true if successful.
es_es: Devuelve verdadero si tuvo éxito.

source: The C<goto-LABEL> form finds the statement labeled with LABEL and resumes execution there.
es_es: La forma C<goto-ETIQUETA> busca la instrucción etiquetada con ETIQUETA y continua la ejecución desde allí.

source: or to force an anon hash constructor use C<+{>:
es_es: o para forzar a un constructor de un hash anónimo use C<+{>:

source: (.*)(\d+)$ <I have 2 numbers: 5314> <7>
es_es: (.*)(\d+)$ <Tengo 2 números: 5314> <7>

source: \x{263A} [1,8] hex char (example: SMILEY)
es_es: \x{263A} [1,8] car. hex. (ejemplo: SMILEY)

source: In either case, starting with Perl 5.14, it returns the seed.
es_es: En cualquier caso, a partir de Perl 5.14, devuelve la semilla.

source: All the warnings related to pack() and unpack() were made more informative and consistent.
es_es: Todos las advertencias relacionadas con pack() y unpack() se hicieron más informativas y consistentes.

source: If the bug you are reporting has security implications, which make it inappropriate to send to a publicly archived mailing list, then please send it to perl5-security-report@perl.org.
es_es: Si el fallo que está reportando tiene implicaciones de seguridad, que lo hace inadecuado para ser enviado a una lista de correo pública, por favor, envíelo a perl5-security-report@perl.org.

source: * multiplication
es_es: * multiplicación

source: If the C</d> modifier is used, the REPLACEMENTLIST is always interpreted exactly as specified.
es_es: Si se usa el modificador C</d>, la LISTA_REEMPLAZO siempre es interpretada exactamente como esté especificada.

source: If @foo doesn't otherwise exist, then it's obviously a character class.
es_es: Si @foo no existe, entonces es obvio que es una clase carácter.

source: Improved C<nanosleep> detection
es_es: Mejorada la detección de C<nanosleep>

source: (@foo,@bar,&SomeSub,%glarch)
es_es: (@foo,@bar,&AlgunaSub,%glarch)

source: Begun in 1993 (see L<perlhist>), Perl version 5 is nearly a complete rewrite that provides the following additional benefits:
es_es: En 1993 (vea L<perlhist>) se lanzó Perl 5, prácticamente una reescritura completa del lenguaje, que proporciona las siguientes ventajas adicionales:

source: @days{'a','c'} # same as ($days{'a'},$days{'c'})
es_es: @dias{'a','c'} # igual que ($dias{'a'},$dias{'c'})

source: Omitting the C<continue> section is equivalent to using an empty one, logically enough, so C<next> goes directly back to check the condition at the top of the loop.
es_es: La omisión de la sección C<continue> es equivalente a usar un bloque vacío, como es lógico, por lo que C<next> va directamente a comprobar la condición en la parte superior del bucle.

source: my @backwards = reverse @numbers;
es_es: my @orden_inverso = reverse @numeros;

source: It is usually a mistake to intermix C<alarm> and C<sleep> calls, because C<sleep> may be internally implemented on your system with C<alarm>.
es_es: Normalmente es un error entremezclar llamadas a C<alarm> y C<sleep>, porque C<sleep> puede ser, internamente, implementado en su sistema con C<alarm>.

source: The call is implemented in terms of either Perl's or your system's native fread(3) library function.
es_es: La llamada es implementada en términos de Perl o de la función nativa fread(3) de su sistema.

source: =head3 (Reminder) The $* variable is deprecated (really)
es_es: =head3 (Recordatorio) La variable $* es obsoleta (de verdad)

source: The C<..> and C<...> flip-flop operators are now evaluated in boolean context, following their usual semantics; see L<perlop/"Range Operators">.
es_es: Los operadores flip-flop C<..> y C<...> ahora son evaluados en contexto booleano, siguiendo su semántica normal; vea L<perlop/"Operadores de rango">.

source: For portably packed integers, either use the formats C<n>, C<N>, C<v>, and C<V> or else use the C<< > >> and C<< < >> modifiers described immediately below.
es_es: Para enteros empaquetados de forma portátil, o bien usar los formatos C<n>, C<N>, C<v>, y C<V> o bien los modificadores C<< > >> y C<< < >> descritos inmediatamente abajo.

source: It is the handler's responsibility to deal with the message as it sees fit (like, for instance, converting it into a C<die>).
es_es: Es responsabilidad del controlador tratar el mensaje como lo considere oportuno (como, por ejemplo, convertirlo en un C<die>).

source: $pattern =~ s/(\W)/\\\1/g;
es_es: $patrón =~ s/(\W)/\\\1/g;

source: =item our TYPE EXPR : ATTRS
es_es: =item our TIPO EXPR : ATRIBUTOS

source: open my $fh, "@_" or die "Can't open '@_': $!";
es_es: open my $fh, "@_" or die "No puedo abrir '@_': $!";

source: =item Keywords related to scoping
es_es: =item Palabras clave relacionadas con el ámbito

source: # example: '# line 42 "new_filename.plx"'
es_es: # ejemplo: '# line 42 "nuevo_archivo.plx"'

source: A positive OFFSET greater than the length of SCALAR results in the string being padded to the required size with C<"\0"> bytes before the result of the read is appended.
es_es: Un DESPLAZAMIENTO positivo mayor que la longitud de ESCALAR resulta en un cadena rellenada al tamaño requerido con bytes C<"\0"> antes de que el resultado de la lectura sea añadido.

source: perldebtut Perl debugging tutorial
es_es: perldebtut Tutorial de depuración

source: If EXPR is omitted, the global (package) scalar variable of the same name as the FILEHANDLE contains the filename.
es_es: Si EXPR se omite, la variable escalar global (a nivel de paquete) del mismo nombre que el IDENTIFICADOR_ARCHIVO contiene el nombre del archivo.

source: Its name comes from the observation that this operation combined with the alternation operator (C<|>) can be used to create what is essentially a pattern-based if/then/else block:
es_es: Su nombre proviene de la observación de que esta operación combinada con el operador de alternancia (C<|>) se puede utilizar para crear lo que es, esencialmente, un bloque basado en un patrón if/then/else:

source: (There is a maintenance penalty for doing this, as mentioning C</o> constitutes a promise that you won't change the variables in the pattern.
es_es: (Hay un castigo en el mantenimiento, al hacer esto, porque al usar C</o> constituye una promesa de que no va a cambiar las variables que hay dentro del patrón.

source: print "Yow!" if $zippy;
es_es: print "¡Caramba!" if $zippy;

source: Version numbers should indicate at least major and minor releases, and possibly sub-minor releases.
es_es: Los números de versión deben indicar al menos las versiones principales y secundarias, y posiblemente, versiones menores.

source: Writes a formatted record (possibly multi-line) to the specified FILEHANDLE, using the format associated with that file.
es_es: Escribe un registro formateado (posiblemente de varias líneas) al IDENTIFICADOR_ARCHIVO especificado, utilizando el formato asociado con ese archivo.

source: Current categories under C<CPAN/modules/by-category/> include Perl core modules; development support; operating system interfaces; networking, devices, and interprocess communication; data type utilities; database interfaces; user interfaces; interfaces to other languages; filenames, file systems, and file locking; internationalization and locale; world wide web support; server and daemon utilities; archiving and compression; image manipulation; mail and news; control flow utilities; filehandle and I/O; Microsoft Windows modules; and miscellaneous modules.
es_es: Las categorías especificadas actualmente en C<CPAN/modules/by-category/> son: Perl core modules (módulos básicos de Perl); development support (utilidades para desarrollo); operating system interfaces (interfaces de sistemas operativos); networking, devices, and interprocess communication (redes, dispositivos y comunicación entre procesos); data type utilities (utilidades para tipos de datos); database interfaces (interfaces de bases de datos); user interfaces (interfaces de usuario); interfaces to other languages (interfaces de otros lenguajes); filenames, file systems, and file locking (nombres de archivos, sistemas de archivos y bloqueo de archivos); internationalization and locale (internacionalización y configuración regional); world wide web support (soporte para world wide web); server and daemon utilities (utilidades para servidores y demonios); archiving and compression (almacenamiento y compresión); image manipulation (manipulación de imágenes); mail and news (correo y noticias); control flow utilities (utilidades para flujo de control); filehandle and I/O (identificadores de archivos y E/S); Microsoft Windows modules (módulos para Microsoft Windows) y miscellaneous (varios).

source: Some comparison documents can be found at http://www.perl.com/doc/FMTEYEWTK/versus/ if you really can't stop yourself.
es_es: Si no puede contener su curiosidad, en http://www.perl.com/doc/FMTEYEWTK/versus/ encontrará algunos documentos con comparaciones.

source: C An unsigned char (octet) value.
es_es: C Un valor de un carácter sin signo (octeto).

source: \V [3] Not vertical whitespace
es_es: \V [3] No espacio en blanco vertical

source: If POSITION is omitted, starts searching from the beginning of the string.
es_es: Si se omite POSICIÓN, comienza a buscar desde el comienzo del string.

source: It will not, in itself, form the B<entire> toolkit.
es_es: No formará, en sí mismo, el kit de herramientas B<entero>.

source: =head2 Error handling and messages
es_es: =head2 Control de errores y mensajes

source: Evaluates the BLOCK or EXPR for each element of LIST (locally setting C<$_> to each element) and returns the list value consisting of those elements for which the expression evaluated to true.
es_es: Evalúa el BLOQUE o EXPRE para cada elemento de LISTA (poniendo localmente C<$_> a cada elemento) y devuelve un valor de lista consistente en los elementos por los que la expresión evaluada es verdadera.

source: C<do BLOCK> does I<not> count as a loop, so the loop control statements C<next>, C<last>, or C<redo> cannot be used to leave or restart the block.
es_es: C<do BLOQUE> I<no> cuenta como un bucle, así que las instrucciones de control de bucle C<next>, C<last>, o C<redo> no pueden ser usadas para dejar o reiniciar el bloque.

source: C<\L>, C<\U>, and C<\Q> can stack, in which case you need one C<\E> for each.
es_es: C<\L>, C<\U>, y C<\Q> pueden apilarse, en cuyo caso necesita un C<\E> por cada uno.

source: $scalar = delete @hash{qw(foo bar)}; # $scalar is 22
es_es: $scalar = delete @hash{qw(foo bar)}; # $scalar es 22

source: eq equality
es_es: eq igual que

source: X</p> X<p modifier>
es_es: X</p> X<p modificador>

source: Value may be given to C<seekdir> to access a particular location in a directory.
es_es: El valor puede ser indicado a C<seekdir> para acceder a un lugar determinado en un directorio.
